---
kind: property
id: P:Autodesk.Revit.DB.CustomFieldData.FieldName
source: html/eb99c50f-1be1-bffe-5939-e61c0a6a9772.htm
---
# Autodesk.Revit.DB.CustomFieldData.FieldName Property

The name of this custom field.

## Syntax (C#)
```csharp
public string FieldName { get; }
```